นโยบายความเป็นส่วนตัว
นโยบายความเป็นส่วนตัวนี้ใช้กับแอป G NET VPN (ต่อไปนี้เรียกว่า "แอปพลิเคชัน") สำหรับอุปกรณ์พกพาที่สร้างโดย G NET VPN (ต่อไปนี้เรียกว่า "ผู้ให้บริการ") ในฐานะบริการฟรี บริการนี้มีวัตถุประสงค์เพื่อใช้ "ตามที่เป็น"

การรวบรวมและการใช้ข้อมูล
แอปพลิเคชันจะรวบรวมข้อมูลเมื่อคุณดาวน์โหลดและใช้งาน ข้อมูลนี้อาจรวมถึงข้อมูล เช่น

ที่อยู่โปรโตคอลอินเทอร์เน็ตของอุปกรณ์ของคุณ (เช่น ที่อยู่ IP)
หน้าต่างๆ ของแอปพลิเคชันที่คุณเข้าชม เวลาและวันที่ที่คุณเข้าชม เวลาที่ใช้ในหน้าเหล่านั้น
เวลาที่ใช้ในแอปพลิเคชัน
ระบบปฏิบัติการที่คุณใช้บนอุปกรณ์พกพาของคุณ

แอปพลิเคชันไม่รวบรวมข้อมูลที่ชัดเจนเกี่ยวกับตำแหน่งของอุปกรณ์พกพาของคุณ

ผู้ให้บริการอาจใช้ข้อมูลที่คุณให้มาเพื่อติดต่อคุณเป็นครั้งคราวเพื่อแจ้งข้อมูลสำคัญ ประกาศที่จำเป็น และโปรโมชั่นทางการตลาดให้คุณทราบ

เพื่อประสบการณ์ที่ดีขึ้น ขณะใช้แอปพลิเคชัน ผู้ให้บริการอาจขอให้คุณให้ข้อมูลส่วนบุคคลบางอย่างแก่เรา  ข้อมูลที่ผู้ให้บริการร้องขอจะถูกเก็บรักษาไว้โดยผู้ให้บริการและใช้ตามที่อธิบายไว้ในนโยบายความเป็นส่วนตัวนี้

การเข้าถึงของบุคคลที่สาม
ข้อมูลรวมที่ไม่ระบุตัวตนเท่านั้นที่จะถูกส่งต่อไปยังบริการภายนอกเป็นระยะๆ เพื่อช่วยให้ผู้ให้บริการปรับปรุงแอปพลิเคชันและบริการของตน ผู้ให้บริการอาจแบ่งปันข้อมูลของคุณกับบุคคลที่สามในลักษณะที่อธิบายไว้ในคำชี้แจงความเป็นส่วนตัวนี้

โปรดทราบว่าแอปพลิเคชันใช้บริการของบุคคลที่สามซึ่งมีนโยบายความเป็นส่วนตัวของตนเองเกี่ยวกับการจัดการข้อมูล ด้านล่างนี้คือลิงก์ไปยังนโยบายความเป็นส่วนตัวของผู้ให้บริการบุคคลที่สามที่แอปพลิเคชันใช้:

บริการ Google Play

ผู้ให้บริการอาจเปิดเผยข้อมูลที่ผู้ใช้ให้มาและรวบรวมโดยอัตโนมัติ:

ตามที่กฎหมายกำหนด เช่น เพื่อปฏิบัติตามหมายเรียกหรือกระบวนการทางกฎหมายที่คล้ายคลึงกัน;
เมื่อพวกเขาเชื่อโดยสุจริตใจว่าการเปิดเผยเป็นสิ่งจำเป็นในการปกป้องสิทธิ์ของพวกเขา ปกป้องความปลอดภัยของคุณหรือความปลอดภัยของผู้อื่น สืบสวนการฉ้อโกง หรือตอบสนองต่อคำขอของรัฐบาล;  กับผู้ให้บริการที่เชื่อถือได้ซึ่งทำงานในนามของพวกเขา จะไม่มีการใช้งานข้อมูลที่เราเปิดเผยให้พวกเขาอย่างอิสระ และได้ตกลงที่จะปฏิบัติตามกฎที่กำหนดไว้ในคำชี้แจงความเป็นส่วนตัวนี้

สิทธิ์ในการไม่ยินยอม
คุณสามารถหยุดการรวบรวมข้อมูลทั้งหมดโดยแอปพลิเคชันได้อย่างง่ายดายโดยการถอนการติดตั้ง คุณสามารถใช้กระบวนการถอนการติดตั้งมาตรฐานที่มีให้เป็นส่วนหนึ่งของอุปกรณ์มือถือของคุณหรือผ่านทางตลาดแอปพลิเคชันมือถือหรือเครือข่าย

นโยบายการเก็บรักษาข้อมูล
ผู้ให้บริการจะเก็บข้อมูลที่ผู้ใช้ให้ไว้ตราบเท่าที่คุณใช้แอปพลิเคชันและเป็นระยะเวลาที่เหมาะสมหลังจากนั้น หากคุณต้องการให้ผู้ให้บริการลบข้อมูลที่ผู้ใช้ให้ไว้ซึ่งคุณให้ไว้ผ่านแอปพลิเคชัน โปรดติดต่อที่ lom132532@gmail.com และผู้ให้บริการจะตอบกลับภายในเวลาที่เหมาะสม

 เด็ก
ผู้ให้บริการจะไม่ใช้แอปพลิเคชันเพื่อขอข้อมูลหรือทำการตลาดกับเด็กอายุต่ำกว่า 13 ปีโดยเจตนา

แอปพลิเคชันนี้ไม่ได้มุ่งเป้าไปที่ใครก็ตามที่มีอายุต่ำกว่า 13 ปี ผู้ให้บริการจะไม่รวบรวมข้อมูลส่วนตัวที่ระบุตัวตนของเด็กอายุต่ำกว่า 13 ปีโดยเจตนา ในกรณีที่ผู้ให้บริการพบว่าเด็กอายุต่ำกว่า 13 ปีได้ให้ข้อมูลส่วนบุคคล ผู้ให้บริการจะลบข้อมูลดังกล่าวออกจากเซิร์ฟเวอร์ทันที หากคุณเป็นผู้ปกครองหรือผู้ดูแล และคุณทราบว่าบุตรหลานของคุณได้ให้ข้อมูลส่วนบุคคลแก่เรา โปรดติดต่อผู้ให้บริการ (lom132532@gmail.com) เพื่อให้พวกเขาสามารถดำเนินการที่จำเป็นได้

ความปลอดภัย
ผู้ให้บริการมีความกังวลเกี่ยวกับการปกป้องความลับของข้อมูลของคุณ ผู้ให้บริการจัดให้มีการป้องกันทางกายภาพ อิเล็กทรอนิกส์ และตามขั้นตอน เพื่อปกป้องข้อมูลที่ผู้ให้บริการประมวลผลและดูแล

การเปลี่ยนแปลง
นโยบายความเป็นส่วนตัวนี้อาจได้รับการอัปเดตเป็นครั้งคราวด้วยเหตุผลใดก็ตาม  ผู้ให้บริการจะแจ้งให้คุณทราบถึงการเปลี่ยนแปลงใดๆ ของนโยบายความเป็นส่วนตัวโดยการอัปเดตหน้านี้ด้วยนโยบายความเป็นส่วนตัวฉบับใหม่ เราขอแนะนำให้คุณตรวจสอบนโยบายความเป็นส่วนตัวนี้เป็นประจำสำหรับการเปลี่ยนแปลงใดๆ เนื่องจากการใช้งานต่อเนื่องถือเป็นการอนุมัติการเปลี่ยนแปลงทั้งหมด

นโยบายความเป็นส่วนตัวนี้มีผลบังคับใช้ตั้งแต่วันที่ 7 มิถุนายน 2025

ความยินยอมของคุณ
การใช้แอปพลิเคชันแสดงว่าคุณยินยอมให้มีการประมวลผลข้อมูลของคุณตามที่ระบุไว้ในนโยบายความเป็นส่วนตัวนี้และตามที่เราแก้ไขเพิ่มเติม

ติดต่อเรา
หากคุณมีคำถามใดๆ เกี่ยวกับความเป็นส่วนตัวขณะใช้แอปพลิเคชันหรือมีคำถามเกี่ยวกับแนวทางปฏิบัติ โปรดติดต่อผู้ให้บริการทางอีเมลที่ lom132532@gmail.com
